对象的增删改查

In [1]:
import pandas as pd

Series结构

In [2]:
data = [10,11,12]
index = ['a','b','c']
s = pd.Series(data = data, index = index)
s

a    10
b    11
c    12
dtype: int64

查

In [3]:
s[0]

10

In [4]:
s[0:2]

a    10
b    11
dtype: int64

In [5]:
mask = [True,False,True]
s[mask]

a    10
c    12
dtype: int64

In [6]:
s.loc['b']

11

In [7]:
s.iloc[1]

11

改

In [8]:
s1 = s.copy()
s1['a'] = 100
s1

a    100
b     11
c     12
dtype: int64

In [9]:
s1.replace(to_replace=100, value=101, inplace=False)

a    101
b     11
c     12
dtype: int64

In [10]:
s1

a    100
b     11
c     12
dtype: int64

In [11]:
s1.index

Index(['a', 'b', 'c'], dtype='object')

In [12]:
s1.index = ['a','b','c1']
s1

a     100
b      11
c1     12
dtype: int64

In [13]:
s1.rename(index = {'a':'A'}, inplace=True)

增

In [14]:
s2 = pd.Series([100,110], index=['g','k'])
s2

g    100
k    110
dtype: int64

In [15]:
s1['j'] = 500

In [16]:
s3 = pd.concat([s1,s2])
s3

A     100
b      11
c1     12
j     500
g     100
k     110
dtype: int64

In [17]:
help(pd.concat)

Help on function concat in module pandas.core.reshape.concat:

concat(objs: 'Iterable[NDFrame] | Mapping[Hashable, NDFrame]', axis: 'Axis' = 0, join: 'str' = 'outer', ignore_index: 'bool' = False, keys=None, levels=None, names=None, verify_integrity: 'bool' = False, sort: 'bool' = False, copy: 'bool' = True) -> 'DataFrame | Series'
    Concatenate pandas objects along a particular axis with optional set logic
    along the other axes.

    Can also add a layer of hierarchical indexing on the concatenation axis,
    which may be useful if the labels are the same (or overlapping) on
    the passed axis number.

    Parameters
    ----------
    objs : a sequence or mapping of Series or DataFrame objects
        If a mapping is passed, the sorted keys will be used as the `keys`
        argument, unless it is passed, in which case the values will be
        selected (see below). Any None objects will be dropped silently unless
        they are all None in which case a ValueError will be raised.
    axis : {0/'index', 1/'columns'}, default 0
        The axis to concatenate along.
    join : {'inner', 'outer'}, default 'outer'
        How to handle indexes on other axis (or axes).
    ignore_index : bool, default False
        If True, do not use the index values along the concatenation axis. The
        resulting axis will be labeled 0, ..., n - 1. This is useful if you are
        concatenating objects where the concatenation axis does not have
        meaningful indexing information. Note the index values on the other
        axes are still respected in the join.
    keys : sequence, default None
        If multiple levels passed, should contain tuples. Construct
        hierarchical index using the passed keys as the outermost level.
    levels : list of sequences, default None
        Specific levels (unique values) to use for constructing a
        MultiIndex. Otherwise they will be inferred from the keys.
    names : list, default None
        Names for the levels in the resulting hierarchical index.
    verify_integrity : bool, default False
        Check whether the new concatenated axis contains duplicates. This can
        be very expensive relative to the actual data concatenation.
    sort : bool, default False
        Sort non-concatenation axis if it is not already aligned when `join`
        is 'outer'.
        This has no effect when ``join='inner'``, which already preserves
        the order of the non-concatenation axis.

        .. versionchanged:: 1.0.0

           Changed to not sort by default.

    copy : bool, default True
        If False, do not copy data unnecessarily.

    Returns
    -------
    object, type of objs
        When concatenating all ``Series`` along the index (axis=0), a
        ``Series`` is returned. When ``objs`` contains at least one
        ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
        the columns (axis=1), a ``DataFrame`` is returned.

    See Also
    --------
    Series.append : Concatenate Series.
    DataFrame.append : Concatenate DataFrames.
    DataFrame.join : Join DataFrames using indexes.
    DataFrame.merge : Merge DataFrames by indexes or columns.

    Notes
    -----
    The keys, levels, and names arguments are all optional.

    A walkthrough of how this method fits in with other tools for combining
    pandas objects can be found `here
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

    Examples
    --------
    Combine two ``Series``.

    >>> s1 = pd.Series(['a', 'b'])
    >>> s2 = pd.Series(['c', 'd'])
    >>> pd.concat([s1, s2])
    0    a
    1    b
    0    c
    1    d
    dtype: object

    Clear the existing index and reset it in the result
    by setting the ``ignore_index`` option to ``True``.

    >>> pd.concat([s1, s2], ignore_index=True)
    0    a
    1    b
    2    c
    3    d
    dtype: object

    Add a hierarchical index at the outermost level of
    the data with the ``keys`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'])
    s1  0    a
        1    b
    s2  0    c
        1    d
    dtype: object

    Label the index keys you create with the ``names`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'],
    ...           names=['Series name', 'Row ID'])
    Series name  Row ID
    s1           0         a
                 1         b
    s2           0         c
                 1         d
    dtype: object

    Combine two ``DataFrame`` objects with identical columns.

    >>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
    ...                    columns=['letter', 'number'])
    >>> df1
      letter  number
    0      a       1
    1      b       2
    >>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
    ...                    columns=['letter', 'number'])
    >>> df2
      letter  number
    0      c       3
    1      d       4
    >>> pd.concat([df1, df2])
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects with overlapping columns
    and return everything. Columns outside the intersection will
    be filled with ``NaN`` values.

    >>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
    ...                    columns=['letter', 'number', 'animal'])
    >>> df3
      letter  number animal
    0      c       3    cat
    1      d       4    dog
    >>> pd.concat([df1, df3], sort=False)
      letter  number animal
    0      a       1    NaN
    1      b       2    NaN
    0      c       3    cat
    1      d       4    dog

    Combine ``DataFrame`` objects with overlapping columns
    and return only those that are shared by passing ``inner`` to
    the ``join`` keyword argument.

    >>> pd.concat([df1, df3], join="inner")
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects horizontally along the x axis by
    passing in ``axis=1``.

    >>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
    ...                    columns=['animal', 'name'])
    >>> pd.concat([df1, df4], axis=1)
      letter  number  animal    name
    0      a       1    bird   polly
    1      b       2  monkey  george

    Prevent the result from including duplicate index values with the
    ``verify_integrity`` option.

    >>> df5 = pd.DataFrame([1], index=['a'])
    >>> df5
       0
    a  1
    >>> df6 = pd.DataFrame([2], index=['a'])
    >>> df6
       0
    a  2
    >>> pd.concat([df5, df6], verify_integrity=True)
    Traceback (most recent call last):
        ...
    ValueError: Indexes have overlapping values: ['a']

删

In [18]:
s1

A     100
b      11
c1     12
j     500
dtype: int64

In [19]:
del s1['A']
s1

b      11
c1     12
j     500
dtype: int64

In [20]:
s1.drop(['b','c1'], inplace=True)
s1

j    500
dtype: int64

DataFrame结构

In [21]:
data = [[1,2,3],[4,5,6]]
index = ['a','b']
columns = ['A','B','C']

df = pd.DataFrame(data=data, index=index, columns=columns)
df

   A  B  C
a  1  2  3
b  4  5  6

查操作

In [22]:
df['A']

a    1
b    4
Name: A, dtype: int64

In [23]:
df.loc['a']

A    1
B    2
C    3
Name: a, dtype: int64

In [24]:
df.iloc[1]

A    4
B    5
C    6
Name: b, dtype: int64

改操作

In [25]:
df.loc['a']['A']

1

In [26]:
df.loc['a']['A'] = 150
df

     A  B  C
a  150  2  3
b    4  5  6

In [27]:
df.index = ['f','g']
df

     A  B  C
f  150  2  3
g    4  5  6

增操作

In [28]:
df.loc['c'] = [1,2,3]
df

     A  B  C
f  150  2  3
g    4  5  6
c    1  2  3

In [29]:
data = [[1,2,3],[4,5,6]]
index = ['j','k']
columns = ['A','B','C']

df2 = pd.DataFrame(data=data, index=index, columns=columns)
df2

   A  B  C
j  1  2  3
k  4  5  6

In [30]:
df3 = pd.concat([df,df2], axis=0)
df3

     A  B  C
f  150  2  3
g    4  5  6
c    1  2  3
j    1  2  3
k    4  5  6

In [31]:
df2['D'] = [10,11]
df2

   A  B  C   D
j  1  2  3  10
k  4  5  6  11

In [32]:
df4 = pd.DataFrame([[10,11],[12,13]], index=['j','k'], columns=['E','F'])
df4

    E   F
j  10  11
k  12  13

In [33]:
df5 = pd.concat([df2,df4], axis=1)
df5

   A  B  C   D   E   F
j  1  2  3  10  10  11
k  4  5  6  11  12  13

删操作

In [34]:
df5.drop(['j'], axis=0, inplace=True)
df5

   A  B  C   D   E   F
k  4  5  6  11  12  13

In [35]:
del df5['D']
df5

   A  B  C   E   F
k  4  5  6  12  13

In [36]:
df5.drop(['A','B','C'], axis=1, inplace=True)
df5

    E   F
k  12  13